In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
x = ['a', 'b', 'c']
y = [10,20,30]
z = np.array(y)
w = {'a':10, 'b':20, 'c':30}

In [6]:
pd.Series(data = y)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data=y, index = x)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(y, x)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(z)

0    10
1    20
2    30
dtype: int32

In [12]:
pd.Series(w)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(x,y)

10    a
20    b
30    c
dtype: object

In [16]:
ser1 = pd.Series([1,2,3,4,5], ['USA', 'Germany', 'UK', 'France', 'Nigeria'])

In [17]:
ser1

USA        1
Germany    2
UK         3
France     4
Nigeria    5
dtype: int64

In [19]:
ser2 = pd.Series([1,4,5,6,3], ['Italy', 'USA', 'Gambia', 'Senegal', 'Spain'])

In [20]:
ser2

Italy      1
USA        4
Gambia     5
Senegal    6
Spain      3
dtype: int64

In [22]:
ser3 = pd.Series(y)

In [23]:
ser1['USA']

1

In [25]:
ser4 = ser1 + ser2

In [27]:
ser4.describe()

count    1.0
mean     5.0
std      NaN
min      5.0
25%      5.0
50%      5.0
75%      5.0
max      5.0
dtype: float64

In [28]:
from numpy.random import randn

In [30]:
np.random.seed(101)

In [36]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C','D','E'],['w', 'x', 'y', 'z'] )

In [38]:
df

          w         x         y         z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [39]:
df.head(1)

         w         x         y         z
A  0.38603  2.084019 -0.376519  0.230336

In [41]:
df["w"]

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: w, dtype: float64

In [42]:
df.x

A    2.084019
B    1.035125
C   -0.741790
D    1.482495
E    1.192241
Name: x, dtype: float64

In [43]:
df.describe()

              w         x         y         z
count  5.000000  5.000000  5.000000  5.000000
mean  -0.065659  1.010418 -0.061175  0.117795
std    1.060611  1.058227  0.738104  1.623276
min   -1.382920 -0.741790 -1.046780 -2.141212
25%   -1.005187  1.035125 -0.376519 -0.732845
50%    0.386030  1.192241 -0.031160  0.230336
75%    0.681209  1.482495  0.187125  1.292765
max    0.992573  2.084019  0.961458  1.939932

In [44]:
df[['w','z']]

          w         z
A  0.386030  0.230336
B  0.681209  1.939932
C -1.005187 -0.732845
D -1.382920 -2.141212
E  0.992573  1.292765

In [45]:
df['n'] = df['w'] + df['y']

In [46]:
df

          w         x         y         z         n
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462
E  0.992573  1.192241 -1.046780  1.292765 -0.054206

In [49]:
df['o'] = df['w'] + df['y']

In [50]:
df

          w         x         y         z         n         o
A  0.386030  2.084019 -0.376519  0.230336  0.009512  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462 -0.421462
E  0.992573  1.192241 -1.046780  1.292765 -0.054206 -0.054206

In [51]:
df.drop('o', axis = 1)

          w         x         y         z         n
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462
E  0.992573  1.192241 -1.046780  1.292765 -0.054206

In [52]:
df

          w         x         y         z         n         o
A  0.386030  2.084019 -0.376519  0.230336  0.009512  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462 -0.421462
E  0.992573  1.192241 -1.046780  1.292765 -0.054206 -0.054206

In [53]:
df.drop('o', axis = 1, inplace = True)

In [54]:
df

          w         x         y         z         n
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462
E  0.992573  1.192241 -1.046780  1.292765 -0.054206

In [55]:
df.drop('E', axis = 0)

          w         x         y         z         n
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462

In [56]:
df

          w         x         y         z         n
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462
E  0.992573  1.192241 -1.046780  1.292765 -0.054206

In [57]:
df.drop('E', axis = 0, inplace = True )

In [58]:
df

          w         x         y         z         n
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462

In [59]:
df.transpose

<bound method DataFrame.transpose of           w         x         y         z         n
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462>

In [60]:
df

          w         x         y         z         n
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462

In [62]:
df.loc['C']

w   -1.005187
x   -0.741790
y    0.187125
z   -0.732845
n   -0.818062
Name: C, dtype: float64

In [65]:
df.iloc[2]

w   -1.005187
x   -0.741790
y    0.187125
z   -0.732845
n   -0.818062
Name: C, dtype: float64

In [66]:
df.iloc[2].transpose

<bound method IndexOpsMixin.transpose of w   -1.005187
x   -0.741790
y    0.187125
z   -0.732845
n   -0.818062
Name: C, dtype: float64>

In [68]:
df

          w         x         y         z         n
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462

In [67]:
df.loc['B', 'y']

-0.031160481493099617

In [69]:
df.loc[['A','B'],['w', 'y']]

          w         y
A  0.386030 -0.376519
B  0.681209 -0.031160

In [70]:
df > 0

       w      x      y      z      n
A   True   True  False   True   True
B   True   True  False   True   True
C  False  False   True  False  False
D  False   True   True  False  False

In [72]:
x = df >= 2

In [74]:
df[x]

    w         x   y   z   n
A NaN  2.084019 NaN NaN NaN
B NaN       NaN NaN NaN NaN
C NaN       NaN NaN NaN NaN
D NaN       NaN NaN NaN NaN

In [75]:
df[df>1]

    w         x   y         z   n
A NaN  2.084019 NaN       NaN NaN
B NaN  1.035125 NaN  1.939932 NaN
C NaN       NaN NaN       NaN NaN
D NaN  1.482495 NaN       NaN NaN

In [76]:
df

          w         x         y         z         n
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462

In [77]:
df['w'] > 0

A     True
B     True
C    False
D    False
Name: w, dtype: bool

In [80]:
df[df['w' ]>0]

          w         x         y         z         n
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049

In [83]:
df[df['z']<0]

          w         x         y         z         n
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462

result = df[df['z']<0]
result

In [85]:
print(result)

          w         x         y         z         n
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462

In [86]:
result.max

<bound method NDFrame._add_numeric_operations.<locals>.max of           w         x         y         z         n
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462>

In [87]:
result.max()

w   -1.005187
x    1.482495
y    0.961458
z   -0.732845
n   -0.421462
dtype: float64

In [89]:
df

          w         x         y         z         n
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462

In [93]:
df[(df['w'] > 0) & (df['n'] > -1)]

          w         x         y         z         n
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049

In [ ]:
df[(df['w'] > 0)  (df['n'] > -1)]

In [94]:
df.reset_index()

  index         w         x         y         z         n
0     A  0.386030  2.084019 -0.376519  0.230336  0.009512
1     B  0.681209  1.035125 -0.031160  1.939932  0.650049
2     C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
3     D -1.382920  1.482495  0.961458 -2.141212 -0.421462

In [95]:
df.backfill()

          w         x         y         z         n
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462

In [99]:
newind = "CA NY WY OR ".split()

In [100]:
newind

['CA', 'NY', 'WY', 'OR']

In [101]:
df['States'] = newind

In [103]:
df.set_index("States")

               w         x         y         z         n
States
CA      0.386030  2.084019 -0.376519  0.230336  0.009512
NY      0.681209  1.035125 -0.031160  1.939932  0.650049
WY     -1.005187 -0.741790  0.187125 -0.732845 -0.818062
OR     -1.382920  1.482495  0.961458 -2.141212 -0.421462

In [107]:
df.columns = {'STATES','AB', 'CA', 'CD', 'PO', 'LO'}

In [108]:
df

         LO        CD        AB    STATES        PO  CA
A  0.386030  2.084019 -0.376519  0.230336  0.009512  CA
B  0.681209  1.035125 -0.031160  1.939932  0.650049  NY
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062  WY
D -1.382920  1.482495  0.961458 -2.141212 -0.421462  OR

In [110]:
outside = ['G1', 'G!', 'G1', 'G1', 'G2', 'G', 'G']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [111]:
hier_index

MultiIndex([('G1', 1),
            ('G!', 2),
            ('G1', 3),
            ('G1', 1),
            ('G2', 2),
            ( 'G', 3)],
           )

In [112]:
df =pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

In [113]:
df

             A         B
G1 1 -1.467514 -0.494095
G! 2 -0.162535  0.485809
G1 3  0.392489  0.221491
   1 -0.855196  1.541990
G2 2  0.666319 -0.538235
G  3 -0.568581  1.407338

In [114]:
df.loc['G1']

          A         B
1 -1.467514 -0.494095
3  0.392489  0.221491
1 -0.855196  1.541990

In [115]:
df.iloc[1]

A   -0.162535
B    0.485809
Name: (G!, 2), dtype: float64

In [118]:
df.index.names = ['Groups', 'Num']

In [119]:
df

                   A         B
Groups Num
G1     1   -1.467514 -0.494095
G!     2   -0.162535  0.485809
G1     3    0.392489  0.221491
       1   -0.855196  1.541990
G2     2    0.666319 -0.538235
G      3   -0.568581  1.407338

In [121]:
df.loc['G2'].loc[2]['B']

-0.5382346255173922

In [123]:
df.loc['G1'].loc[1]['B']

Num
1   -0.494095
1    1.541990
Name: B, dtype: float64

In [124]:
df.xs('G1')

            A         B
Num
1   -1.467514 -0.494095
3    0.392489  0.221491
1   -0.855196  1.541990

In [125]:
df.xs(1, level ='Num')

               A         B
Groups
G1     -1.467514 -0.494095
G1     -0.855196  1.541990

Missing Data

In [127]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan], 'C':[1,2,3] }

In [128]:
df = pd.DataFrame(d)

In [129]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [130]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [131]:
df.dropna(axis =1)

   C
0  1
1  2
2  3

In [133]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [135]:
df.fillna(value='sc')

     A    B  C
0  1.0  5.0  1
1  2.0   sc  2
2   sc   sc  3

In [136]:
df['A']. fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [137]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Group

In [138]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales': [200,120,340,124,243,350]}

In [139]:
df = data

In [141]:
df = pd.DataFrame(data)

In [142]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [146]:
x = df.groupby('Company')

In [147]:
x.mean()

C:\Users\ojaga\AppData\Local\Temp\ipykernel_36792\3791599204.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  x.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [148]:
x.sum()

C:\Users\ojaga\AppData\Local\Temp\ipykernel_36792\2925620302.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  x.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [149]:
x.sum().loc['FB']

C:\Users\ojaga\AppData\Local\Temp\ipykernel_36792\2382481780.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  x.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [152]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [156]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [157]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [158]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [159]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [160]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [163]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [164]:
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [165]:
pd.concat([df1,df2,df3], axis = 0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [166]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [167]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [168]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [169]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [170]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [172]:
pd.merge(left, right, on = ['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [176]:
pd.merge(left, right, how = 'outer', on = ['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [177]:
pd.merge(left, right, how = 'inner', on = ['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [178]:
pd.merge(left, right, how = 'right', on = ['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [179]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [180]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [181]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [182]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [183]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [184]:
df['col2'].unique()

3

In [187]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [188]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [192]:
def times2(x):
    return x*2

In [194]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [195]:
df['col1'].apply(lambda x:x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [196]:
x =df.drop('col1', axis = 1, inplace = True)

In [198]:
print(x)

None

In [199]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [200]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [203]:
df.sort_values('col2', axis = 0)

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [204]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [205]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [206]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [209]:
df.pivot_table(values='D', index = ['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [210]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\ojaga\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ojaga\anaconda3\lib\site-packages (from sqlalchemy) (2.0.1)

In [212]:
!pip install lxml

Requirement already satisfied: lxml in c:\users\ojaga\anaconda3\lib\site-packages (4.9.2)

In [213]:
!pip install html5lib

Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
                                              0.0/112.2 kB ? eta -:--:--
     ----------------------------------     102.4/112.2 kB 2.9 MB/s eta 0:00:01
     -------------------------------------- 112.2/112.2 kB 2.2 MB/s eta 0:00:00
Requirement already satisfied: six>=1.9 in c:\users\ojaga\anaconda3\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\users\ojaga\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Installing collected packages: html5lib
Successfully installed html5lib-1.1

In [214]:
!pip install BeautifulSoup4

Requirement already satisfied: BeautifulSoup4 in c:\users\ojaga\anaconda3\lib\site-packages (4.12.2)
Requirement already satisfied: soupsieve>1.2 in c:\users\ojaga\anaconda3\lib\site-packages (from BeautifulSoup4) (2.4)

In [215]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [216]:
df=pd.read_csv('example.csv')

In [217]:
df.to_csv('My_output', index = False)

In [218]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [220]:
df = pd.read_excel('Excel_Sample.xlsx')

In [221]:
df.to_excel('Excel_Sample2.xlsx', sheet_name = 'NewSheet')

In [222]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [224]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [228]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

ValueError: No tables found

In [230]:
import requests
from bs4 import BeautifulSoup

url = 'http://www.fdic.gov/bank/individual/failed/banklist.html'
response = requests.get(url)
soup = BeautifulSoup(response.content, 'html.parser')

# Find tables using BeautifulSoup
tables = soup.find_all('table')

# Parse tables into pandas DataFrames
dfs = pd.read_html(str(tables))

# Print the first DataFrame
print(dfs[0])

ValueError: No tables found

In [232]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')

In [233]:
df.to_sql('my_table', engine)

4

In [234]:
sqldf = pd.read_sql('my_table', con=engine)

In [235]:
sqldf

   index  Unnamed: 0   a   b   c   d
0      0           0   0   1   2   3
1      1           1   4   5   6   7
2      2           2   8   9  10  11
3      3           3  12  13  14  15

In [236]:
int(input('enter a number...'))

enter a number...14

14